rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
/**@brief Function for handling Peer Manager events                   
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(false);
            break;

        default:
            break;
    }
}

static void twi_address_scan(uint8_t* addresses, uint8_t* device_count)
{
    //This method scans for all possible TWI addresses on the current bus. If an
    //address is found it gets added to the given array of addresses and the cound
    //of device gets incremented.
    uint8_t sample_data;

    for (uint8_t add = 0; add <= 127; add++)
    {
        ret_code_t err_code;
        m_xfer_done = false;
        do
        {
            err_code = nrf_drv_twi_rx(m_twi, add, &sample_data, sizeof(sample_data));
        } while (err_code == 0x11); //if the nrf is currently busy doing something else this line will wait until its done before executing
        while (m_xfer_done == false); //this line forces the program to wait for the TWI transfer to complete before moving on
        //nrf_delay_ms(50); //add a slight delay after the reading to allow time for logs to print

        if (m_twi_bus_status == NRF_DRV_TWI_EVT_DONE)
        {
            //A sensor was found so we add it to the list
            addresses[(*device_count)++] = add;
        }
    }
}

static void enable_twi_bus(int instance_id)
{
    //This method enables the given twi bus instance, as well as turns on any 
    //necessary power and pullup resistor pins. It also disables the other twi
    //instance in the case that it's currently on.

    nrf_drv_twi_disable(m_twi); //disable the current bus
    if (instance_id == INTERNAL_TWI_INSTANCE_ID)
    {
        m_twi = &m_twi_internal;

        //Send power to the internal sensors and the pullup resistor,
        //also make sure that power for the external sensors is off
        nrf_gpio_pin_set(BLE_33_PULLUP);
        nrf_gpio_pin_set(BLE_33_SENSOR_POWER_PIN);
        
        nrf_gpio_pin_clear(EXTERNAL_SENSOR_POWER_PIN);
    }
    else
    {
        m_twi = &m_twi_external;

        //Send power to the external sensors. also make sure that power,
        //afor the internal sensors and the pullup resistor is off
        nrf_gpio_pin_set(EXTERNAL_SENSOR_POWER_PIN);

        nrf_gpio_pin_clear(BLE_33_PULLUP);
        nrf_gpio_pin_clear(BLE_33_SENSOR_POWER_PIN);
    }

    nrf_delay_ms(50); //slight delay so sensors have time to power on
    nrf_drv_twi_enable(m_twi); //enable the new bus
}

/**@brief Function for the LSM9DS1 initialization.
 *
 * @details Initializes the LSM9DS1 accelerometer, gyroscope and magnetometer
 */
static void sensors_init(void)
{
    //First reset the sensor settings array, everything goes to zero except
    //the sensor models which are set to the default sensors.
    for (int i = 0; i < SENSOR_SETTINGS_LENGTH; i++) sensor_settings[i] = 0;
    sensor_settings[ACC_START + SENSOR_MODEL] = default_sensors[0];
    sensor_settings[GYR_START + SENSOR_MODEL] = default_sensors[1];
    sensor_settings[MAG_START + SENSOR_MODEL] = default_sensors[2];

    //Next we scan both the external and internal TWI lines to see what sensors we can find
    //Check the external bus first
    enable_twi_bus(INTERNAL_TWI_INSTANCE_ID);
    twi_address_scan(internal_sensors, &internal_sensors_found);

    //Then check the internal bus
    enable_twi_bus(EXTERNAL_TWI_INSTANCE_ID);
    twi_address_scan(external_sensors, &external_sensors_found);

    //Scan the external sensors to see if any of them match the default sensors that were
    //set in the settings array. If not, then scan the internal sensors to see if any of
    //them are there. If one of the default sensors isn't found on either bus then a
    //different one will need to be selected.

    //Handle the initialization of individual sensors
    lsm9ds1_init(&lsm9ds1_imu, &lsm9ds1_mag, sensor_settings, m_twi, &m_xfer_done, USE_EXTERNAL_SENSORS);

    //after sensor initialization is complete we attempt to communicate 
    //with each sensor just to ensure that it's there and working properly.
    //To do so, turn on the TWI bus and configure/turn on any power pin(s) and/or pullup resistors
    nrf_drv_twi_enable(m_twi);

    //configure the power pin and pullup resistor pins for the the sensors
    if (USE_EXTERNAL_SENSORS)
    {
        nrf_gpio_cfg(EXTERNAL_SENSOR_POWER_PIN, NRF_GPIO_PIN_DIR_OUTPUT, NRF_GPIO_PIN_INPUT_CONNECT, NRF_GPIO_PIN_NOPULL, NRF_GPIO_PIN_S0H1, NRF_GPIO_PIN_NOSENSE);

        nrf_gpio_pin_set(EXTERNAL_SENSOR_POWER_PIN);
        nrf_delay_ms(50); //slight delay so sensors have time to power on
    }
    else
    {
        nrf_gpio_cfg_output(BLE_33_PULLUP); //send power to BLE 33 Sense pullup resistors (they aren't connected to VDD)
        nrf_gpio_cfg(BLE_33_SENSOR_POWER_PIN, NRF_GPIO_PIN_DIR_OUTPUT, NRF_GPIO_PIN_INPUT_CONNECT, NRF_GPIO_PIN_NOPULL, NRF_GPIO_PIN_S0H1, NRF_GPIO_PIN_NOSENSE);

        nrf_gpio_pin_set(BLE_33_PULLUP);
        nrf_gpio_pin_set(BLE_33_SENSOR_POWER_PIN);
        nrf_delay_ms(50); //slight delay so sensors have time to power on
    }

    //attempt to read the WHOAMI register for each sensor
    uint32_t ret = lsm9ds1_dev_id_get(&lsm9ds1_mag, &lsm9ds1_imu, &whoamI);
    if (whoamI.imu == LSM9DS1_IMU_ID) SEGGER_RTT_WriteString(0, "LSM9DS1 discovered.\n");
    else SEGGER_RTT_WriteString(0, "Error: Couldn't find LSM9DS1.\n");

    //In the future, more sensors can be initialized here

    //regardless of whether or not any sensors are found, disable the power pins and TWI bus
    if (USE_EXTERNAL_SENSORS)
    {
        nrf_gpio_pin_clear(EXTERNAL_SENSOR_POWER_PIN);
    }
    else
    {
        nrf_gpio_pin_clear(BLE_33_PULLUP);
        nrf_gpio_pin_clear(BLE_33_SENSOR_POWER_PIN);
    }
    
    nrf_drv_twi_disable(m_twi);

    //After all sensors have been initialized, update the sensor settings characteristic to 
    //reflect the sensor settings array. Furthermore, we also set the connection interval 
    //to be equal to the highest sensor ODR (to the nearest 15th millisecond)
    ble_gatts_value_t settings;
    settings.len = SENSOR_SETTINGS_LENGTH;
    settings.p_value = sensor_settings;
    settings.offset = 0;
    uint32_t err_code = sd_ble_gatts_value_set(m_conn_handle, m_ss.settings_handles.value_handle, &settings);
    APP_ERROR_CHECK(err_code);
}

static void characteristic_update_and_notify()
{
    
    ble_gatts_hvx_params_t acc_notify_params, gyr_notify_params, mag_notify_params;
    memset(&acc_notify_params, 0, sizeof(acc_notify_params));
    memset(&gyr_notify_params, 0, sizeof(gyr_notify_params));
    memset(&mag_notify_params, 0, sizeof(mag_notify_params));

