rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

        APP_ERROR_CHECK(err_code);
    }
}

void internal_twi_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
    //A handler that gets called when events happen on the TWI bus. I'm currently not really using this 
    //method for anything as my sensor reading functions work on a timer. I should keep this function though.
    m_twi_bus_status = p_event->type;
    switch (p_event->type)
    {
        case NRF_DRV_TWI_EVT_DONE:
            //SEGGER_RTT_printf(0, "Successfully reached slave address 0x%x.\n", p_event->xfer_desc.address);
            //if (p_event->xfer_desc.type == NRF_DRV_TWI_XFER_TXRX | p_event->xfer_desc.type == NRF_DRV_TWI_XFER_RX)
            //{
            //    //uncomment below line after the data_handler function has been written
            //    //data_handler(m_data);
            //}
            break;
        case NRF_DRV_TWI_EVT_ADDRESS_NACK:
            SEGGER_RTT_printf(0, "Address NACK received while trying to reach slave address 0x%x.\n", p_event->xfer_desc.address);
            break;
        case NRF_DRV_TWI_EVT_DATA_NACK:
            SEGGER_RTT_printf(0, "Data NACK received while trying to reach slave address 0x%x.\n", p_event->xfer_desc.address);
            break;
        case NRFX_TWI_EVT_OVERRUN:
            SEGGER_RTT_printf(0, "Overrun event while trying to reach slave address 0x%x.\n", p_event->xfer_desc.address);
            break;
        case NRFX_TWI_EVT_BUS_ERROR:
            SEGGER_RTT_printf(0, "Bus Error received while trying to reach slave address 0x%x.\n", p_event->xfer_desc.address);
            break;
        default:
            SEGGER_RTT_WriteString(0, "Something other than Event Done was achieved.\n");
            break;
    }

    NRF_LOG_PROCESS();
    m_xfer_done = true; //this must be set to true before another TWI transaction can occur
}

void external_twi_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
    //A handler that gets called when events happen on the TWI bus. I'm currently not really using this 
    //method for anything as my sensor reading functions work on a timer. I should keep this function though.
    m_twi_bus_status = p_event->type;
    switch (p_event->type)
    {
        case NRF_DRV_TWI_EVT_DONE:
            //SEGGER_RTT_printf(0, "Successfully reached slave address 0x%x.\n", p_event->xfer_desc.address);
            //if (p_event->xfer_desc.type == NRF_DRV_TWI_XFER_TXRX | p_event->xfer_desc.type == NRF_DRV_TWI_XFER_RX)
            //{
            //    //uncomment below line after the data_handler function has been written
            //    //data_handler(m_data);
            //}
            break;
        case NRF_DRV_TWI_EVT_ADDRESS_NACK:
            SEGGER_RTT_printf(0, "Address NACK received while trying to reach slave address 0x%x.\n", p_event->xfer_desc.address);
            break;
        case NRF_DRV_TWI_EVT_DATA_NACK:
            SEGGER_RTT_printf(0, "Data NACK received while trying to reach slave address 0x%x.\n", p_event->xfer_desc.address);
            break;
        case NRFX_TWI_EVT_OVERRUN:
            SEGGER_RTT_printf(0, "Overrun event while trying to reach slave address 0x%x.\n", p_event->xfer_desc.address);
            break;
        case NRFX_TWI_EVT_BUS_ERROR:
            SEGGER_RTT_printf(0, "Bus Error received while trying to reach slave address 0x%x.\n", p_event->xfer_desc.address);
            break;
        default:
            SEGGER_RTT_WriteString(0, "Something other than Event Done was achieved.\n");
            break;
    }

    NRF_LOG_PROCESS();
    m_xfer_done = true; //this must be set to true before another TWI transaction can occur
}

void  twi_init (void)
{
    ret_code_t err_code;

    //if (USE_EXTERNAL_SENSORS)
    //{
    //    const nrf_drv_twi_config_t twi_lsm9ds1_config = {
    //   .scl                = EXTERNAL_SCL_PIN,
    //   .sda                = EXTERNAL_SDA_PIN,
    //   .frequency          = NRF_DRV_TWI_FREQ_400K,
    //   .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
    //   .clear_bus_init     = false
    //    };

    //    //A handler method is necessary to enable non-blocking mode. TXRX operations can only be carried 
    //    //out when non-blocking mode is enabled so a handler is needed here.
    //    err_code = nrf_drv_twi_init(&m_twi, &twi_lsm9ds1_config, twi_handler, NULL);
    //    APP_ERROR_CHECK(err_code);
    //}
    //else
    //{
    //    const nrf_drv_twi_config_t twi_lsm9ds1_config = {
    //   .scl                = BLE_33_SCL_PIN,
    //   .sda                = BLE_33_SDA_PIN,
    //   .frequency          = NRF_DRV_TWI_FREQ_400K,
    //   .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
    //   .clear_bus_init     = false
    //    };

    //    //A handler method is necessary to enable non-blocking mode. TXRX operations can only be carried 
    //    //out when non-blocking mode is enabled so a handler is needed here.
    //    err_code = nrf_drv_twi_init(&m_twi, &twi_lsm9ds1_config, twi_handler, NULL);
    //    APP_ERROR_CHECK(err_code);
    //}

    //There are two separate TWI buses that are used here. One for communication with
    //sensors that are on the current board, and one for communication with sensors that
    //are external to the board.
    const nrf_drv_twi_config_t twi_internal_config = {
       .scl                = BLE_33_SCL_PIN,
       .sda                = BLE_33_SDA_PIN,
       .frequency          = NRF_DRV_TWI_FREQ_400K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = true
        };

