rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    const nrf_drv_twi_config_t twi_external_config = {
       .scl                = EXTERNAL_SCL_PIN,
       .sda                = EXTERNAL_SDA_PIN,
       .frequency          = NRF_DRV_TWI_FREQ_400K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = true
        };

    //A handler method is necessary to enable non-blocking mode. TXRX operations can only be carried 
    //out when non-blocking mode is enabled so a handler is needed here.
    err_code = nrf_drv_twi_init(&m_twi_internal, &twi_internal_config, internal_twi_handler, NULL);
    err_code = nrf_drv_twi_init(&m_twi_external, &twi_external_config, external_twi_handler, NULL);
    APP_ERROR_CHECK(err_code);

    //After initializing the buses, configure the necessary gpio pins to use these buses
    nrf_gpio_cfg_output(BLE_33_PULLUP); //send power to BLE 33 Sense pullup resistors (they aren't connected to VDD)
    nrf_gpio_cfg(BLE_33_SENSOR_POWER_PIN, NRF_GPIO_PIN_DIR_OUTPUT, NRF_GPIO_PIN_INPUT_CONNECT, NRF_GPIO_PIN_NOPULL, NRF_GPIO_PIN_S0H1, NRF_GPIO_PIN_NOSENSE);

    nrf_gpio_cfg(EXTERNAL_SENSOR_POWER_PIN, NRF_GPIO_PIN_DIR_OUTPUT, NRF_GPIO_PIN_INPUT_CONNECT, NRF_GPIO_PIN_NOPULL, NRF_GPIO_PIN_S0H1, NRF_GPIO_PIN_NOSENSE);
}

static void leds_init()
{
    //configure the pins for the BLE 33 Sense on-board red, green and blue tri-colored LED.

    if (USE_EXTERNAL_LEDS)
    {
        nrf_gpio_cfg_output(EXTERNAL_RED_LED);
        nrf_gpio_cfg_output(EXTERNAL_BLUE_LED);
        nrf_gpio_cfg_output(EXTERNAL_GREEN_LED);
    }
    else
    {
        nrf_gpio_cfg_output(BLE_33_RED_LED);
        nrf_gpio_cfg_output(BLE_33_BLUE_LED);
        nrf_gpio_cfg_output(BLE_33_GREEN_LED);

        //these LEDs are situated backwards from what you would expect so the pin needs to be 
        //pulled high for the LEDs to turn off
        nrf_gpio_pin_set(BLE_33_RED_LED);
        nrf_gpio_pin_set(BLE_33_BLUE_LED);
        nrf_gpio_pin_set(BLE_33_GREEN_LED);
    }
    
}

/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    log_init();
    timers_init();
    power_management_init();
    ble_stack_init();
    gatt_init();
    services_init();
    twi_init();
    sensors_init();
    gap_params_init();
    advertising_init();
    conn_params_init();
    peer_manager_init();
    leds_init();
  
    NRF_LOG_FLUSH(); //flush out all logs called during initialization

    // Start execution.
    NRF_LOG_INFO("Personal Caddie Initialized");
    NRF_LOG_PROCESS();
    application_timers_start();

    advertising_start(erase_bonds);

    // Enter main loop.
    for (;;)
    {
        idle_state_handle(); //puts CPU into sleep and waits for an even signal to wake it up
    }
}

static int32_t get_IMU_data(uint8_t offset)
{
    //Reads the raw accelerometer and magnetometer data and stores it in their respective arrays.
    //First read the gyroscope data

    uint8_t new_data[6];
    int ret = lsm9ds1_read_reg(&lsm9ds1_imu, LSM9DS1_OUT_X_L_G, gyr_characteristic_data + offset, 6);

    //If there aren't any issues then read the accelerometer data
    if (ret == 0)
    {
        //SEGGER_RTT_printf(0, "Base Characteristic Address: 0x%#08x\n", acc_characteristic_data);
        //SEGGER_RTT_printf(0, "Writing data to address: 0x%#08x\n", acc_characteristic_data + offset);
        ret = lsm9ds1_read_reg(&lsm9ds1_imu, LSM9DS1_OUT_X_L_XL, acc_characteristic_data + offset, 6);
    }

    return ret;
}

static int32_t get_MAG_data(uint8_t offset)
{
    //Reads the raw magnetometer data and stores it in its respective array
    int ret = lsm9ds1_read_reg(&lsm9ds1_mag, LSM9DS1_OUT_X_L_M, mag_characteristic_data + offset, 6);

    return ret;
}

/**
 * @}
 */
